tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18854_tdd.h
#define CCP4MODE1                     1091
#define CCP4CON_MODE2                 1092
#define CCP4MODE2                     1093
#define CCP4CON_MODE3                 1094
#define CCP4MODE3                     1095
#define CCP4FMT                       1096
#define CCP4CON_FMT                   1097
#define CCP4CON_OUT                   1098
#define CCP4OUT                       1099
#define CCP4OE                        1100
#define CCP4CON_OE                    1101
#define CCP4EN                        1102
#define CCP4CON_EN                    1103
#define CCP4CAP                       1104
#define CCP4CAP_CTS0                  1105
#define CCP4CTS                       1106
#define CCP4CAP_CTS                   1107
#define CCP4CTS0                      1108
#define CCP4CAP_CTS1                  1109
#define CCP4CTS1                      1110
#define CCP4CAP_CTS2                  1111
#define CCP4CTS2                      1112
#define CCPR5L                        1113
#define CCPR5L_RL                     1114
#define CCPR5H                        1115
#define CCPR5H_RH                     1116
#define CCP5CON                       1117
#define CCP5CON_MODE                  1118
#define CCP5MODE                      1119
#define CCP5MODE0                     1120
#define CCP5CON_MODE0                 1121
#define CCP5MODE1                     1122
#define CCP5CON_MODE1                 1123
#define CCP5MODE2                     1124
#define CCP5CON_MODE2                 1125
#define CCP5MODE3                     1126
#define CCP5CON_MODE3                 1127
#define CCP5FMT                       1128
#define CCP5CON_FMT                   1129
#define CCP5CON_OUT                   1130
#define CCP5OUT                       1131
#define CCP5CON_OE                    1132
#define CCP5OE                        1133
#define CCP5EN                        1134
#define CCP5CON_EN                    1135
#define CCP5CAP                       1136
#define CCP5CAP_CTS                   1137
#define CCP5CTS0                      1138
#define CCP5CAP_CTS0                  1139
#define CCP5CTS                       1140
#define CCP5CTS1                      1141
#define CCP5CAP_CTS1                  1142
#define CCP5CTS2                      1143
#define CCP5CAP_CTS2                  1144
#define PWM6DCL                       1145
#define PWM6DCL_DC                    1146
#define PWM6DCL_DC0                   1147
#define PWM6DCL_PWMPW0                1148
#define PWM6DC0                       1149
#define PWM6DCL_DC1                   1150
#define PWM6DCL_PWMPW1                1151
#define PWM6DC1                       1152
#define PWM6DCH                       1153
#define PWM6DCH_DC2                   1154
#define PWM6DCH_DC                    1155
#define PWM6DCH_PWMPW2                1156
#define PWM6DC2                       1157
#define PWM6DCH_DC3                   1158
#define PWM6DCH_PWMPW3                1159
#define PWM6DC3                       1160
#define PWM6DCH_DC4                   1161
#define PWM6DCH_PWMPW4                1162
#define PWM6DC4                       1163
#define PWM6DCH_DC5                   1164
#define PWM6DCH_PWMPW5                1165
#define PWM6DC5                       1166
#define PWM6DCH_DC6                   1167
#define PWM6DCH_PWMPW6                1168
#define PWM6DC6                       1169
#define PWM6DCH_DC7                   1170
#define PWM6DCH_PWMPW7                1171
#define PWM6DC7                       1172
#define PWM6DCH_DC8                   1173
#define PWM6DC8                       1174
#define PWM6DCH_PWMPW8                1175
#define PWM6DCH_DC9                   1176
#define PWM6DC9                       1177
#define PWM6DCH_PWMPW9                1178
#define PWM6CON                       1179
#define PWM6POL                       1180
#define PWM6CON_POL                   1181
#define PWM6OUT                       1182
#define PWM6CON_OUT                   1183
#define PWM6CON_OE                    1184
#define PWM6OE                        1185
#define PWM6CON_EN                    1186
#define PWM6EN                        1187
#define PWM7DCL                       1188
#define PWM7DCL_PWMPW0                1189
#define PWM7DC0                       1190
#define PWM7DCL_DC                    1191
#define PWM7DCL_DC0                   1192
#define PWM7DCL_PWMPW1                1193
#define PWM7DC1                       1194
#define PWM7DCL_DC1                   1195
#define PWM7DCH                       1196
#define PWM7DCH_DC2                   1197
#define PWM7DCH_DC                    1198
#define PWM7DC2                       1199
#define PWM7DCH_PWMPW2                1200
#define PWM7DCH_PWMPW3                1201
#define PWM7DCH_DC3                   1202
#define PWM7DC3                       1203
#define PWM7DCH_PWMPW4                1204
#define PWM7DCH_DC4                   1205
#define PWM7DC4                       1206
#define PWM7DCH_PWMPW5                1207
#define PWM7DCH_DC5                   1208
#define PWM7DC5                       1209
#define PWM7DCH_DC6                   1210
#define PWM7DC6                       1211
#define PWM7DCH_PWMPW6                1212
#define PWM7DCH_DC7                   1213
#define PWM7DC7                       1214
#define PWM7DCH_PWMPW7                1215
#define PWM7DCH_DC8                   1216
#define PWM7DCH_PWMPW8                1217
#define PWM7DC8                       1218
#define PWM7DCH_DC9                   1219
#define PWM7DCH_PWMPW9                1220
#define PWM7DC9                       1221
#define PWM7CON                       1222
#define PWM7POL                       1223
#define PWM7CON_POL                   1224
#define PWM7CON_OUT                   1225
#define PWM7OUT                       1226
#define PWM7CON_OE                    1227
#define PWM7OE                        1228
#define PWM7EN                        1229
#define PWM7CON_EN                    1230
#define SCANLADRL                     1231
#define LADR0                         1232
#define LADRL                         1233
#define SCANLADR0                     1234
#define SCANLADR1                     1235
#define LADR1                         1236
#define LADR2                         1237
#define SCANLADR2                     1238
#define LADR3                         1239
#define SCANLADR3                     1240
#define LADR4                         1241
#define SCANLADR4                     1242
#define LADR5                         1243
#define SCANLADR5                     1244
#define LADR6                         1245
#define SCANLADR6                     1246
#define LADR7                         1247
#define SCANLADR7                     1248
#define LADR8                         1249
#define SCANLADRH                     1250
#define LADRH                         1251
#define SCANLADR8                     1252
#define LADR9                         1253
#define SCANLADR9                     1254
#define LADR10                        1255
#define SCANLADR10                    1256
#define LADR11                        1257
#define SCANLADR11                    1258
#define LADR12                        1259
#define SCANLADR12                    1260
#define LADR13                        1261
#define SCANLADR13                    1262
#define LADR14                        1263
#define SCANLADR14                    1264
#define SCANLADR15                    1265
#define LADR15                        1266
#define SCANHADR0                     1267
#define HADR0                         1268
#define HADRL                         1269
#define SCANHADRL                     1270
#define SCANHADR1                     1271
#define HADR1                         1272
#define SCANHADR2                     1273
#define HADR2                         1274
#define SCANHADR3                     1275
#define HADR3                         1276
#define SCANHADR4                     1277
#define HADR4                         1278
#define SCANHADR5                     1279
#define HADR5                         1280
#define SCANHADR6                     1281
#define HADR6                         1282
#define SCANHADR7                     1283
#define HADR7                         1284
#define HADR8                         1285
#define SCANHADR8                     1286
#define HADRH                         1287
#define SCANHADRH                     1288
#define HADR9                         1289
#define SCANHADR9                     1290
#define SCANHADR10                    1291
#define HADR10                        1292
#define HADR11                        1293
#define SCANHADR11                    1294
#define HADR12                        1295
#define SCANHADR12                    1296
#define HADR13                        1297
#define SCANHADR13                    1298
#define HADR14                        1299
#define SCANHADR14                    1300
#define HADR15                        1301
#define SCANHADR15                    1302
#define SCANCON0                      1303
#define SCANMODE                      1304
#define SCANMODE0                     1305
#define SCANCON0_MODE0                1306
#define SCANCON0_MODE                 1307
#define SCANCON0_MODE1                1308
#define SCANMODE1                     1309
#define INTM                          1310
#define SCANINTM                      1311
#define DABORT                        1312
#define INVALID                       1313
#define SCANINVALID                   1314
#define SCANCON0_BUSY                 1315
#define SCANBUSY                      1316
#define SCANGO                        1317
#define SCANEN                        1318
#define SCANCON0_EN                   1319
#define SCANTRIG                      1320
#define TSEL0                         1321
#define TSEL                          1322
#define SCANTSEL0                     1323
#define SCANTSEL                      1324
#define TSEL1                         1325
#define SCANTSEL1                     1326
#define TSEL2                         1327
#define SCANTSEL2                     1328
#define TSEL3                         1329
#define SCANTSEL3                     1330
#define CRCDATL                       1331
#define DATA0                         1332
#define DATA1                         1333
#define DATA2                         1334
#define DATA3                         1335
#define DATA4                         1336
#define DATA5                         1337
#define DATA6                         1338
#define DATA7                         1339
#define CRCDATH                       1340
#define DATA8                         1341
#define DATA9                         1342
#define DATA10                        1343
#define DATA11                        1344
#define DATA12                        1345
#define DATA13                        1346
#define DATA14                        1347
#define DATA15                        1348
#define CRCACCL                       1349
#define ACC0                          1350
#define ACC1                          1351
#define ACC2                          1352
#define ACC3                          1353
#define ACC4                          1354
#define ACC5                          1355
#define ACC6                          1356
#define ACC7                          1357
#define CRCACCH                       1358
#define ACC8                          1359
#define ACC9                          1360
#define ACC10                         1361
#define ACC11                         1362
#define ACC12                         1363
#define ACC13                         1364
#define ACC14                         1365
#define ACC15                         1366
#define CRCSHIFTL                     1367
#define SHFT0                         1368
#define SHFT1                         1369
#define SHFT2                         1370
#define SHFT3                         1371
#define SHFT4                         1372
#define SHFT5                         1373
#define SHFT6                         1374
#define SHFT7                         1375
#define CRCSHIFTH                     1376
#define SHFT8                         1377
#define SHFT9                         1378
#define SHFT10                        1379
#define SHFT11                        1380
#define SHFT12                        1381
#define SHFT13                        1382
#define SHFT14                        1383
#define SHFT15                        1384
#define CRCXORL                       1385
#define X1                            1386
#define X2                            1387
#define X3                            1388
#define X4                            1389
#define X5                            1390
#define X6                            1391
#define X7                            1392
#define CRCXORH                       1393
#define X8                            1394
#define X9                            1395
#define X10                           1396
#define X11                           1397
#define X12                           1398
#define X13                           1399
#define X14                           1400
#define X15                           1401
#define CRCCON0                       1402
#define FULL                          1403
#define SHIFTM                        1404
#define ACCM                          1405
#define CRCCON0_BUSY                  1406
#define CRCGO                         1407
#define CRCCON0_EN                    1408
#define CRCEN                         1409
#define CRCCON1                       1410
#define PLEN0                         1411
#define PLEN                          1412
#define PLEN1                         1413
#define PLEN2                         1414
#define PLEN3                         1415
#define DLEN                          1416
#define DLEN0                         1417
#define DLEN1                         1418
#define DLEN2                         1419
#define DLEN3                         1420
#define SMT1TMRL                      1421
#define SMT1TMR0                      1422
#define SMT1TMRL_SMT1TMR              1423
#define SMT1TMR1                      1424
#define SMT1TMR2                      1425
#define SMT1TMR3                      1426
#define SMT1TMR4                      1427
#define SMT1TMR5                      1428
#define SMT1TMR6                      1429
#define SMT1TMR7                      1430
#define SMT1TMRH                      1431
#define SMT1TMR8                      1432
#define SMT1TMRH_SMT1TMR              1433
#define SMT1TMR9                      1434
#define SMT1TMR10                     1435
#define SMT1TMR11                     1436
#define SMT1TMR12                     1437
#define SMT1TMR13                     1438
#define SMT1TMR14                     1439
#define SMT1TMR15                     1440
#define SMT1TMRU                      1441
#define SMT1TMR16                     1442
#define SMT1TMRU_SMT1TMR              1443
#define SMT1TMR17                     1444
#define SMT1TMR18                     1445
#define SMT1TMR19                     1446
#define SMT1TMR20                     1447
#define SMT1TMR21                     1448
#define SMT1TMR22                     1449
#define SMT1TMR23                     1450
#define SMT1CPRL                      1451
#define SMT1CPRL_CPR0                 1452
#define SMT1CPRL_SMT1CPR              1453
#define SMT1CPRL_CPR                  1454
#define SMT1CPRL_CPR1                 1455
#define SMT1CPRL_CPR2                 1456
#define SMT1CPRL_CPR3                 1457
#define SMT1CPRL_CPR4                 1458
#define SMT1CPRL_CPR5                 1459
#define SMT1CPRL_CPR6                 1460
#define SMT1CPRL_CPR7                 1461
#define SMT1CPRH                      1462
#define SMT1CPRH_CPR                  1463
#define SMT1CPRH_SMT1CPR              1464
#define SMT1CPR8                      1465
#define SMT1CPRH_CPR8                 1466
#define SMT1CPRH_CPR9                 1467
#define SMT1CPR9                      1468
#define SMT1CPRH_CPR10                1469
#define SMT1CPR10                     1470
#define SMT1CPRH_CPR11                1471
#define SMT1CPR11                     1472
#define SMT1CPR12                     1473
#define SMT1CPRH_CPR12                1474
#define SMT1CPRH_CPR13                1475
#define SMT1CPR13                     1476
#define SMT1CPRH_CPR14                1477
#define SMT1CPR14                     1478
#define SMT1CPRH_CPR15                1479
#define SMT1CPR15                     1480
#define SMT1CPRU                      1481
#define SMT1CPRU_CPR16                1482
#define SMT1CPRU_SMT1CPR              1483
#define SMT1CPR16                     1484
#define SMT1CPRU_CPR                  1485
#define SMT1CPRU_CPR17                1486
#define SMT1CPR17                     1487
#define SMT1CPRU_CPR18                1488
#define SMT1CPR18                     1489
#define SMT1CPRU_CPR19                1490
#define SMT1CPR19                     1491
#define SMT1CPR20                     1492
#define SMT1CPRU_CPR20                1493
#define SMT1CPR21                     1494
#define SMT1CPRU_CPR21                1495
#define SMT1CPR22                     1496
#define SMT1CPRU_CPR22                1497
#define SMT1CPR23                     1498
#define SMT1CPRU_CPR23                1499
#define SMT1CPWL                      1500
#define SMT1CPW0                      1501
#define SMT1CPWL_CPW0                 1502
#define SMT1CPWL_CPW                  1503
#define SMT1CPWL_SMT1CPW              1504
#define SMT1CPW1                      1505
#define SMT1CPWL_CPW1                 1506
#define SMT1CPW2                      1507
#define SMT1CPWL_CPW2                 1508
#define SMT1CPW3                      1509
#define SMT1CPWL_CPW3                 1510
#define SMT1CPW4                      1511
#define SMT1CPWL_CPW4                 1512
#define SMT1CPW5                      1513
#define SMT1CPWL_CPW5                 1514
#define SMT1CPW6                      1515
#define SMT1CPWL_CPW6                 1516
#define SMT1CPW7                      1517
#define SMT1CPWL_CPW7                 1518
#define SMT1CPWH                      1519
#define SMT1CPW8                      1520
#define SMT1CPWH_CPW8                 1521
#define SMT1CPWH_SMT1CPW              1522
#define SMT1CPWH_CPW                  1523
#define SMT1CPW9                      1524
#define SMT1CPWH_CPW9                 1525
#define SMT1CPWH_CPW10                1526
#define SMT1CPW10                     1527
#define SMT1CPWH_CPW11                1528
#define SMT1CPW11                     1529
#define SMT1CPWH_CPW12                1530
#define SMT1CPW12                     1531
#define SMT1CPWH_CPW13                1532
#define SMT1CPW13                     1533
#define SMT1CPWH_CPW14                1534
#define SMT1CPW14                     1535
#define SMT1CPWH_CPW15                1536
#define SMT1CPW15                     1537
#define SMT1CPWU                      1538
#define SMT1CPWU_CPW                  1539
#define SMT1CPWU_SMT1CPW              1540
#define SMT1CPW16                     1541
#define SMT1CPWU_CPW16                1542
#define SMT1CPW17                     1543
#define SMT1CPWU_CPW17                1544
#define SMT1CPW18                     1545
#define SMT1CPWU_CPW18                1546
#define SMT1CPW19                     1547
#define SMT1CPWU_CPW19                1548
#define SMT1CPWU_CPW20                1549
#define SMT1CPW20                     1550
#define SMT1CPWU_CPW21                1551
#define SMT1CPW21                     1552
#define SMT1CPWU_CPW22                1553
#define SMT1CPW22                     1554
#define SMT1CPWU_CPW23                1555
#define SMT1CPW23                     1556
#define SMT1PRL                       1557
#define SMT1PR0                       1558
#define SMT1PRL_SMT1PR                1559
#define SMT1PR1                       1560
#define SMT1PR2                       1561
#define SMT1PR3                       1562
#define SMT1PR4                       1563
#define SMT1PR5                       1564
#define SMT1PR6                       1565
#define SMT1PR7                       1566
#define SMT1PRH                       1567
#define SMT1PR8                       1568
#define SMT1PRH_SMT1PR                1569
#define SMT1PR9                       1570
#define SMT1PR10                      1571
#define SMT1PR11                      1572
#define SMT1PR12                      1573
#define SMT1PR13                      1574
#define SMT1PR14                      1575
#define SMT1PR15                      1576
#define SMT1PRU                       1577
#define SMT1PR16                      1578
#define SMT1PRU_SMT1PR                1579
#define SMT1PR17                      1580
#define SMT1PR18                      1581
#define SMT1PR19                      1582
#define SMT1PR20                      1583
#define SMT1PR21                      1584
#define SMT1PR22                      1585
#define SMT1PR23                      1586
#define SMT1CON0                      1587
#define SMT1PS0                       1588
#define SMT1PS                        1589
#define SMT1PS1                       1590
#define SMT1CON0_CPOL                 1591
#define SMT1CON0_SPOL                 1592
#define SMT1CON0_WPOL                 1593
#define SMT1CON0_STP                  1594
#define SMT1EN                        1595
#define SMT1CON0_EN                   1596
#define SMT1CON1                      1597
#define SMT1CON1_MODE                 1598
#define SMT1CON1_MODE0                1599
#define SMT1CON1_MODE1                1600
#define SMT1CON1_MODE2                1601
#define SMT1CON1_MODE3                1602
#define SMT1CON1_REPEAT               1603
#define SMT1GO                        1604
#define SMT1STAT                      1605
#define SMT1STAT_AS                   1606
#define SMT1AS                        1607
#define SMT1STAT_WS                   1608
#define SMT1WS                        1609
#define SMT1STAT_TS                   1610
#define SMT1TS                        1611
#define SMT1RESET                     1612
#define SMT1STAT_RST                  1613
#define SMT1CPWUP                     1614
#define SMT1STAT_CPWUP                1615
#define SMT1CPRUP                     1616
#define SMT1STAT_CPRUP                1617
#define SMT1CLK                       1618
#define SMT1CLK_CSEL0                 1619
#define SMT1CSEL0                     1620
#define SMT1CSEL                      1621
#define SMT1CLK_CSEL                  1622
#define SMT1CSEL1                     1623
#define SMT1CLK_CSEL1                 1624
#define SMT1CSEL2                     1625
#define SMT1CLK_CSEL2                 1626
#define SMT1SIG                       1627
#define SMT1SSEL                      1628
#define SMT1SIG_SSEL0                 1629
#define SMT1SIG_SSEL                  1630
#define SMT1SSEL0                     1631
#define SMT1SIG_SSEL1                 1632
#define SMT1SSEL1                     1633
#define SMT1SIG_SSEL2                 1634
#define SMT1SSEL2                     1635
#define SMT1SIG_SSEL3                 1636
#define SMT1SSEL3                     1637
#define SMT1SIG_SSEL4                 1638
#define SMT1SSEL4                     1639
#define SMT1WIN                       1640
#define SMT1WSEL                      1641
#define SMT1WSEL0                     1642
#define SMT1WIN_WSEL0                 1643
#define SMT1WIN_WSEL                  1644
#define SMT1WSEL1                     1645
#define SMT1WIN_WSEL1                 1646
#define SMT1WIN_WSEL2                 1647
#define SMT1WSEL2                     1648
