tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18854_tdd.h
#define CM2PSEL                       2765
#define CM2PSEL_PCH                   2766
#define C2PCH                         2767
#define C2PCH0                        2768
#define CM2PSEL_PCH0                  2769
#define C2PCH1                        2770
#define CM2PSEL_PCH1                  2771
#define CM2PSEL_PCH2                  2772
#define C2PCH2                        2773
#define CLCDATA                       2774
#define MLC1OUT                       2775
#define MLC2OUT                       2776
#define MLC3OUT                       2777
#define MLC4OUT                       2778
#define CLC1CON                       2779
#define CLC1CON_MODE                  2780
#define LC1MODE0                      2781
#define LC1MODE                       2782
#define CLC1CON_MODE0                 2783
#define LC1MODE1                      2784
#define CLC1CON_MODE1                 2785
#define LC1MODE2                      2786
#define CLC1CON_MODE2                 2787
#define LC1INTN                       2788
#define CLC1CON_INTN                  2789
#define LC1INTP                       2790
#define CLC1CON_INTP                  2791
#define LC1OUT                        2792
#define CLC1CON_OUT                   2793
#define LC1EN                         2794
#define CLC1CON_EN                    2795
#define CLC1POL                       2796
#define LC1G1POL                      2797
#define CLC1POL_G1POL                 2798
#define CLC1POL_G2POL                 2799
#define LC1G2POL                      2800
#define LC1G3POL                      2801
#define CLC1POL_G3POL                 2802
#define LC1G4POL                      2803
#define CLC1POL_G4POL                 2804
#define CLC1POL_POL                   2805
#define LC1POL                        2806
#define CLC1SEL0                      2807
#define LC1D1S                        2808
#define CLC1SEL0_D1S0                 2809
#define LC1D1S0                       2810
#define CLC1SEL0_D1S                  2811
#define CLC1SEL0_D1S1                 2812
#define LC1D1S1                       2813
#define CLC1SEL0_D1S2                 2814
#define LC1D1S2                       2815
#define CLC1SEL0_D1S3                 2816
#define LC1D1S3                       2817
#define LC1D1S4                       2818
#define CLC1SEL0_D1S4                 2819
#define CLC1SEL0_D1S5                 2820
#define LC1D1S5                       2821
#define LC1D1S6                       2822
#define CLC1SEL0_D1S6                 2823
#define LC1D1S7                       2824
#define CLC1SEL0_D1S7                 2825
#define CLC1SEL1                      2826
#define CLC1SEL1_D2S                  2827
#define CLC1SEL1_D2S0                 2828
#define LC1D2S0                       2829
#define LC1D2S                        2830
#define CLC1SEL1_D2S1                 2831
#define LC1D2S1                       2832
#define CLC1SEL1_D2S2                 2833
#define LC1D2S2                       2834
#define CLC1SEL1_D2S3                 2835
#define LC1D2S3                       2836
#define LC1D2S4                       2837
#define CLC1SEL1_D2S4                 2838
#define D2S5                          2839
#define LC1D2S5                       2840
#define LC1D2S6                       2841
#define CLC1SEL1_D2S6                 2842
#define CLC1SEL1_D2S7                 2843
#define LC1D2S7                       2844
#define CLC1SEL2                      2845
#define CLC1SEL2_D3S                  2846
#define LC1D3S0                       2847
#define LC1D3S                        2848
#define CLC1SEL2_D3S0                 2849
#define LC1D3S1                       2850
#define CLC1SEL2_D3S1                 2851
#define LC1D3S2                       2852
#define CLC1SEL2_D3S2                 2853
#define LC1D3S3                       2854
#define CLC1SEL2_D3S3                 2855
#define LC1D3S4                       2856
#define CLC1SEL2_D3S4                 2857
#define LC1D3S5                       2858
#define CLC1SEL2_D3S5                 2859
#define LC1D3S6                       2860
#define CLC1SEL2_D3S6                 2861
#define LC1D3S7                       2862
#define CLC1SEL2_D3S7                 2863
#define CLC1SEL3                      2864
#define LC1D4S                        2865
#define CLC1SEL3_D4S                  2866
#define LC1D4S0                       2867
#define CLC1SEL3_D4S0                 2868
#define LC1D4S1                       2869
#define CLC1SEL3_D4S1                 2870
#define LC1D4S2                       2871
#define CLC1SEL3_D4S2                 2872
#define LC1D4S3                       2873
#define CLC1SEL3_D4S3                 2874
#define LC1D4S4                       2875
#define CLC1SEL3_D4S4                 2876
#define LC1D4S5                       2877
#define CLC1SEL3_D4S5                 2878
#define LC1D4S6                       2879
#define CLC1SEL3_D4S6                 2880
#define LC1D4S7                       2881
#define CLC1SEL3_D4S7                 2882
#define CLC1GLS0                      2883
#define CLC1GLS0_D1N                  2884
#define LC1G1D1N                      2885
#define CLC1GLS0_D1T                  2886
#define LC1G1D1T                      2887
#define LC1G1D2N                      2888
#define CLC1GLS0_D2N                  2889
#define LC1G1D2T                      2890
#define CLC1GLS0_D2T                  2891
#define CLC1GLS0_D3N                  2892
#define LC1G1D3N                      2893
#define CLC1GLS0_D3T                  2894
#define LC1G1D3T                      2895
#define CLC1GLS0_D4N                  2896
#define LC1G1D4N                      2897
#define CLC1GLS0_D4T                  2898
#define LC1G1D4T                      2899
#define CLC1GLS1                      2900
#define CLC1GLS1_D1N                  2901
#define LC1G2D1N                      2902
#define LC1G2D1T                      2903
#define CLC1GLS1_D1T                  2904
#define CLC1GLS1_D2N                  2905
#define LC1G2D2N                      2906
#define LC1G2D2T                      2907
#define CLC1GLS1_D2T                  2908
#define CLC1GLS1_D3N                  2909
#define LC1G2D3N                      2910
#define LC1G2D3T                      2911
#define CLC1GLS1_D3T                  2912
#define CLC1GLS1_D4N                  2913
#define LC1G2D4N                      2914
#define LC1G2D4T                      2915
#define CLC1GLS1_D4T                  2916
#define CLC1GLS2                      2917
#define CLC1GLS2_D1N                  2918
#define LC1G3D1N                      2919
#define LC1G3D1T                      2920
#define CLC1GLS2_D1T                  2921
#define LC1G3D2N                      2922
#define CLC1GLS2_D2N                  2923
#define LC1G3D2T                      2924
#define CLC1GLS2_D2T                  2925
#define CLC1GLS2_D3N                  2926
#define LC1G3D3N                      2927
#define LC1G3D3T                      2928
#define CLC1GLS2_D3T                  2929
#define LC1G3D4N                      2930
#define CLC1GLS2_D4N                  2931
#define LC1G3D4T                      2932
#define CLC1GLS2_D4T                  2933
#define CLC1GLS3                      2934
#define LC1G4D1N                      2935
#define CLC1GLS3_G4D1N                2936
#define LC1G4D1T                      2937
#define CLC1GLS3_G4D1T                2938
#define CLC1GLS3_G4D2N                2939
#define LC1G4D2N                      2940
#define CLC1GLS3_G4D2T                2941
#define LC1G4D2T                      2942
#define LC1G4D3N                      2943
#define CLC1GLS3_G4D3N                2944
#define LC1G4D3T                      2945
#define CLC1GLS3_G4D3T                2946
#define CLC1GLS3_G4D4N                2947
#define LC1G4D4N                      2948
#define CLC1GLS3_G4D4T                2949
#define LC1G4D4T                      2950
#define CLC2CON                       2951
#define LC2MODE0                      2952
#define CLC2CON_MODE                  2953
#define LC2MODE                       2954
#define CLC2CON_MODE0                 2955
#define LC2MODE1                      2956
#define CLC2CON_MODE1                 2957
#define LC2MODE2                      2958
#define CLC2CON_MODE2                 2959
#define LC2INTN                       2960
#define CLC2CON_INTN                  2961
#define LC2INTP                       2962
#define CLC2CON_INTP                  2963
#define CLC2CON_OUT                   2964
#define LC2OUT                        2965
#define CLC2CON_EN                    2966
#define LC2EN                         2967
#define CLC2POL                       2968
#define LC2G1POL                      2969
#define CLC2POL_G1POL                 2970
#define LC2G2POL                      2971
#define CLC2POL_G2POL                 2972
#define LC2G3POL                      2973
#define CLC2POL_G3POL                 2974
#define LC2G4POL                      2975
#define CLC2POL_G4POL                 2976
#define CLC2POL_POL                   2977
#define LC2POL                        2978
#define CLC2SEL0                      2979
#define CLC2SEL0_D1S                  2980
#define LC2D1S                        2981
#define LC2D1S0                       2982
#define CLC2SEL0_D1S0                 2983
#define LC2D1S1                       2984
#define CLC2SEL0_D1S1                 2985
#define LC2D1S2                       2986
#define CLC2SEL0_D1S2                 2987
#define LC2D1S3                       2988
#define CLC2SEL0_D1S3                 2989
#define LC2D1S4                       2990
#define CLC2SEL0_D1S4                 2991
#define LC2D1S5                       2992
#define CLC2SEL0_D1S5                 2993
#define LC2D1S6                       2994
#define CLC2SEL0_D1S6                 2995
#define LC2D1S7                       2996
#define CLC2SEL0_D1S7                 2997
#define CLC2SEL1                      2998
#define LC2D2S0                       2999
#define LC2D2S                        3000
#define CLC2SEL1_D2S                  3001
#define CLC2SEL1_D2S0                 3002
#define LC2D2S1                       3003
#define CLC2SEL1_D2S1                 3004
#define LC2D2S2                       3005
#define CLC2SEL1_D2S2                 3006
#define LC2D2S3                       3007
#define CLC2SEL1_D2S3                 3008
#define LC2D2S4                       3009
#define CLC2SEL1_D2S4                 3010
#define LC2D2S5                       3011
#define CLC2SEL1_D2S5                 3012
#define LC2D2S6                       3013
#define CLC2SEL1_D2S6                 3014
#define LC2D2S7                       3015
#define CLC2SEL1_D2S7                 3016
#define CLC2SEL2                      3017
#define CLC2SEL2_D3S0                 3018
#define LC2D3S                        3019
#define CLC2SEL2_D3S                  3020
#define LC2D3S0                       3021
#define CLC2SEL2_D3S1                 3022
#define LC2D3S1                       3023
#define CLC2SEL2_D3S2                 3024
#define LC2D3S2                       3025
#define CLC2SEL2_D3S3                 3026
#define LC2D3S3                       3027
#define CLC2SEL2_D3S4                 3028
#define LC2D3S4                       3029
#define CLC2SEL2_D3S5                 3030
#define LC2D3S5                       3031
#define CLC2SEL2_D3S6                 3032
#define LC2D3S6                       3033
#define CLC2SEL2_D3S7                 3034
#define LC2D3S7                       3035
#define CLC2SEL3                      3036
#define LC2D4S                        3037
#define CLC2SEL3_D4S0                 3038
#define LC2D4S0                       3039
#define CLC2SEL3_D4S                  3040
#define CLC2SEL3_D4S1                 3041
#define LC2D4S1                       3042
#define CLC2SEL3_D4S2                 3043
#define LC2D4S2                       3044
#define CLC2SEL3_D4S3                 3045
#define LC2D4S3                       3046
#define CLC2SEL3_D4S4                 3047
#define LC2D4S4                       3048
#define CLC2SEL3_D4S5                 3049
#define LC2D4S5                       3050
#define CLC2SEL3_D4S6                 3051
#define LC2D4S6                       3052
#define CLC2SEL3_D4S7                 3053
#define LC2D4S7                       3054
#define CLC2GLS0                      3055
#define LC2G1D1N                      3056
#define CLC2GLS0_D1N                  3057
#define CLC2GLS0_D1T                  3058
#define LC2G1D1T                      3059
#define LC2G1D2N                      3060
#define CLC2GLS0_D2N                  3061
#define CLC2GLS0_D2T                  3062
#define LC2G1D2T                      3063
#define LC2G1D3N                      3064
#define CLC2GLS0_D3N                  3065
#define CLC2GLS0_D3T                  3066
#define LC2G1D3T                      3067
#define LC2G1D4N                      3068
#define CLC2GLS0_D4N                  3069
#define CLC2GLS0_D4T                  3070
#define LC2G1D4T                      3071
#define CLC2GLS1                      3072
#define CLC2GLS1_D1N                  3073
#define LC2G2D1N                      3074
#define CLC2GLS1_D1T                  3075
#define LC2G2D1T                      3076
#define CLC2GLS1_D2N                  3077
#define LC2G2D2N                      3078
#define CLC2GLS1_D2T                  3079
#define LC2G2D2T                      3080
#define LC2G2D3N                      3081
#define CLC2GLS1_D3N                  3082
#define LC2G2D3T                      3083
#define CLC2GLS1_D3T                  3084
#define LC2G2D4N                      3085
#define CLC2GLS1_D4N                  3086
#define LC2G2D4T                      3087
#define CLC2GLS1_D4T                  3088
#define CLC2GLS2                      3089
#define LC2G3D1N                      3090
#define CLC2GLS2_D1N                  3091
#define CLC2GLS2_D1T                  3092
#define LC2G3D1T                      3093
#define CLC2GLS2_D2N                  3094
#define LC2G3D2N                      3095
#define LC2G3D2T                      3096
#define CLC2GLS2_D2T                  3097
#define CLC2GLS2_D3N                  3098
#define LC2G3D3N                      3099
#define CLC2GLS2_D3T                  3100
#define LC2G3D3T                      3101
#define CLC2GLS2_D4N                  3102
#define LC2G3D4N                      3103
#define LC2G3D4T                      3104
#define CLC2GLS2_D4T                  3105
#define CLC2GLS3                      3106
#define LC2G4D1N                      3107
#define CLC2GLS3_G4D1N                3108
#define CLC2GLS3_G4D1T                3109
#define LC2G4D1T                      3110
#define CLC2GLS3_G4D2N                3111
#define LC2G4D2N                      3112
#define LC2G4D2T                      3113
#define CLC2GLS3_G4D2T                3114
#define CLC2GLS3_G4D3N                3115
#define LC2G4D3N                      3116
#define CLC2GLS3_G4D3T                3117
#define LC2G4D3T                      3118
#define LC2G4D4N                      3119
#define CLC2GLS3_G4D4N                3120
#define CLC2GLS3_G4D4T                3121
#define LC2G4D4T                      3122
#define CLC3CON                       3123
#define LC3MODE                       3124
#define CLC3CON_MODE0                 3125
#define LC3MODE0                      3126
#define CLC3CON_MODE                  3127
#define CLC3CON_MODE1                 3128
#define LC3MODE1                      3129
#define CLC3CON_MODE2                 3130
#define LC3MODE2                      3131
#define LC3INTN                       3132
#define CLC3CON_INTN                  3133
#define LC3INTP                       3134
#define CLC3CON_INTP                  3135
#define LC3OUT                        3136
#define CLC3CON_OUT                   3137
#define LC3EN                         3138
#define CLC3CON_EN                    3139
#define CLC3POL                       3140
#define LC3G1POL                      3141
#define CLC3POL_G1POL                 3142
#define LC3G2POL                      3143
#define CLC3POL_G2POL                 3144
#define CLC3POL_G3POL                 3145
#define LC3G3POL                      3146
#define LC3G4POL                      3147
#define CLC3POL_G4POL                 3148
#define LC3POL                        3149
#define CLC3POL_POL                   3150
#define CLC3SEL0                      3151
#define LC3D1S                        3152
#define CLC3SEL0_D1S                  3153
#define LC3D1S0                       3154
#define CLC3SEL0_D1S0                 3155
#define LC3D1S1                       3156
#define CLC3SEL0_D1S1                 3157
#define LC3D1S2                       3158
#define CLC3SEL0_D1S2                 3159
#define LC3D1S3                       3160
#define CLC3SEL0_D1S3                 3161
#define LC3D1S4                       3162
#define CLC3SEL0_D1S4                 3163
#define LC3D1S5                       3164
#define CLC3SEL0_D1S5                 3165
#define LC3D1S6                       3166
#define CLC3SEL0_D1S6                 3167
#define LC3D1S7                       3168
#define CLC3SEL0_D1S7                 3169
#define CLC3SEL1                      3170
#define LC3D2S0                       3171
#define LC3D2S                        3172
#define CLC3SEL1_D2S0                 3173
#define CLC3SEL1_D2S                  3174
#define LC3D2S1                       3175
#define CLC3SEL1_D2S1                 3176
#define LC3D2S2                       3177
#define CLC3SEL1_D2S2                 3178
#define LC3D2S3                       3179
#define CLC3SEL1_D2S3                 3180
#define LC3D2S4                       3181
#define CLC3SEL1_D2S4                 3182
#define LC3D2S5                       3183
#define CLC3SEL1_D2S5                 3184
#define LC3D2S6                       3185
#define CLC3SEL1_D2S6                 3186
#define LC3D2S7                       3187
#define CLC3SEL1_D2S7                 3188
#define CLC3SEL2                      3189
#define LC3D3S                        3190
#define CLC3SEL2_D3S                  3191
#define LC3D3S0                       3192
#define CLC3SEL2_D3S0                 3193
#define LC3D3S1                       3194
#define CLC3SEL2_D3S1                 3195
#define LC3D3S2                       3196
#define CLC3SEL2_D3S2                 3197
#define LC3D3S3                       3198
#define CLC3SEL2_D3S3                 3199
#define LC3D3S4                       3200
#define CLC3SEL2_D3S4                 3201
#define LC3D3S5                       3202
#define CLC3SEL2_D3S5                 3203
#define LC3D3S6                       3204
#define CLC3SEL2_D3S6                 3205
#define LC3D3S7                       3206
#define CLC3SEL2_D3S7                 3207
#define CLC3SEL3                      3208
#define CLC3SEL3_D4S                  3209
#define LC3D4S0                       3210
#define LC3D4S                        3211
#define CLC3SEL3_D4S0                 3212
#define LC3D4S1                       3213
#define CLC3SEL3_D4S1                 3214
#define LC3D4S2                       3215
#define CLC3SEL3_D4S2                 3216
#define LC3D4S3                       3217
#define CLC3SEL3_D4S3                 3218
#define LC3D4S4                       3219
#define CLC3SEL3_D4S4                 3220
#define LC3D4S5                       3221
#define CLC3SEL3_D4S5                 3222
#define LC3D4S6                       3223
#define CLC3SEL3_D4S6                 3224
#define LC3D4S7                       3225
#define CLC3SEL3_D4S7                 3226
#define CLC3GLS0                      3227
#define CLC3GLS0_D1N                  3228
#define LC3G1D1N                      3229
#define LC3G1D1T                      3230
#define CLC3GLS0_D1T                  3231
#define LC3G1D2N                      3232
#define CLC3GLS0_D2N                  3233
#define CLC3GLS0_D2T                  3234
#define LC3G1D2T                      3235
#define CLC3GLS0_D3N                  3236
#define LC3G1D3N                      3237
#define LC3G1D3T                      3238
#define CLC3GLS0_D3T                  3239
#define CLC3GLS0_D4N                  3240
#define LC3G1D4N                      3241
#define CLC3GLS0_D4T                  3242
#define LC3G1D4T                      3243
#define CLC3GLS1                      3244
#define LC3G2D1N                      3245
#define CLC3GLS1_D1N                  3246
#define CLC3GLS1_D1T                  3247
#define LC3G2D1T                      3248
#define LC3G2D2N                      3249
#define CLC3GLS1_D2N                  3250
#define LC3G2D2T                      3251
#define CLC3GLS1_D2T                  3252
#define LC3G2D3N                      3253
#define CLC3GLS1_D3N                  3254
#define CLC3GLS1_D3T                  3255
#define LC3G2D3T                      3256
#define LC3G2D4N                      3257
#define CLC3GLS1_D4N                  3258
#define LC3G2D4T                      3259
#define CLC3GLS1_D4T                  3260
#define CLC3GLS2                      3261
#define LC3G3D1N                      3262
#define CLC3GLS2_D1N                  3263
#define LC3G3D1T                      3264
#define CLC3GLS2_D1T                  3265
#define CLC3GLS2_D2N                  3266
#define LC3G3D2N                      3267
#define CLC3GLS2_D2T                  3268
#define LC3G3D2T                      3269
#define CLC3GLS2_D3N                  3270
#define LC3G3D3N                      3271
#define LC3G3D3T                      3272
#define CLC3GLS2_D3T                  3273
#define CLC3GLS2_D4N                  3274
#define LC3G3D4N                      3275
#define CLC3GLS2_D4T                  3276
#define LC3G3D4T                      3277
#define CLC3GLS3                      3278
#define LC3G4D1N                      3279
#define CLC3GLS3_G4D1N                3280
#define LC3G4D1T                      3281
#define CLC3GLS3_G4D1T                3282
#define LC3G4D2N                      3283
#define CLC3GLS3_G4D2N                3284
#define CLC3GLS3_G4D2T                3285
#define LC3G4D2T                      3286
#define LC3G4D3N                      3287
#define CLC3GLS3_G4D3N                3288
#define CLC3GLS3_G4D3T                3289
#define LC3G4D3T                      3290
#define LC3G4D4N                      3291
#define CLC3GLS3_G4D4N                3292
#define LC3G4D4T                      3293
#define CLC3GLS3_G4D4T                3294
#define CLC4CON                       3295
#define LC4MODE                       3296
#define CLC4CON_MODE                  3297
#define LC4MODE0                      3298
#define CLC4CON_MODE0                 3299
#define LC4MODE1                      3300
#define CLC4CON_MODE1                 3301
#define LC4MODE2                      3302
#define CLC4CON_MODE2                 3303
#define LC4INTN                       3304
#define CLC4CON_INTN                  3305
#define CLC4CON_INTP                  3306
#define LC4INTP                       3307
#define CLC4CON_OUT                   3308
#define LC4OUT                        3309
#define CLC4CON_EN                    3310
#define LC4EN                         3311
#define CLC4POL                       3312
#define CLC4POL_G1POL                 3313
#define LC4G1POL                      3314
#define CLC4POL_G2POL                 3315
#define LC4G2POL                      3316
#define CLC4POL_G3POL                 3317
#define LC4G3POL                      3318
#define LC4G4POL                      3319
#define CLC4POL_G4POL                 3320
#define LC4POL                        3321
#define CLC4POL_POL                   3322
